src/Enums/InventoryTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>InventoryTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NonInventory</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/InventoryCosting.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>InventoryCosting</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>WeightedAverage</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FIFO</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Products.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Products</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CostingMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.InventoryCosting</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>cfg:EnumRef.InventoryTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InventoryOrExpenseAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomeAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>COGSAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PurchaseVATCode</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATCodes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesVATCode</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATCodes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UM</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UM</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultLocation</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Locations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>api_code</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PreferredVendor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF1String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF2String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF3String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF1Num</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF2Num</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF3Num</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Category</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductCategories</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/WebServices/itemspost/Ext/Module.bsl
Function inout(jsonin)
		
	ParsedJSON = InternetConnectionClientServer.DecodeJSON(jsonin);
		
	NewProduct = Catalogs.Products.CreateItem();
	
	NewProduct.Code = ParsedJSON.item_code;
	NewProduct.Description = ParsedJSON.item_description;
	
	Try
		If ParsedJSON.item_type = "inventory" Then
			NewProduct.Type = Enums.InventoryTypes.Inventory;
			NewProduct.CostingMethod = Enums.InventoryCosting.WeightedAverage;
			NewProduct.InventoryOrExpenseAccount = Constants.InventoryAccount.Get();
		ElsIf ParsedJSON.item_type = "non-inventory" Then
			NewProduct.Type = Enums.InventoryTypes.NonInventory;
		Else
			NewProduct.Type = Enums.InventoryTypes.NonInventory;
		EndIf;
	Except
		NewProduct.Type = Enums.InventoryTypes.NonInventory;
	EndTry;
	
	NewProduct.IncomeAccount = Constants.IncomeAccount.Get();
	
	
	Try
		If ParsedJSON.item_type = "inventory" Then
			NewProduct.COGSAccount = Constants.COGSAccount.Get();
		Else
		EndIf;
	Except
	EndTry;
	NewProduct.PurchaseVATCode = Constants.DefaultPurchaseVAT.Get();
	NewProduct.SalesVATCode = Constants.DefaultSalesVAT.Get();
	NewProduct.api_code = GeneralFunctions.NextProductNumber();

	NewProduct.Write();
		
	///
		
	ProductData = New Map();
	ProductData.Insert("item_code", NewProduct.Code);
	ProductData.Insert("api_code", GeneralFunctions.LeadingZeros(NewProduct.api_code));
	ProductData.Insert("item_description", NewProduct.Description);
	If NewProduct.Type = Enums.InventoryTypes.Inventory Then
		ProductData.Insert("item_type", "inventory");
	ElsIf NewProduct.Type = Enums.InventoryTypes.NonInventory Then
		ProductData.Insert("item_type", "non-inventory");	
	EndIf;
	
	jsonout = InternetConnectionClientServer.EncodeJSON(ProductData,,True,True);	                    
	
	Return jsonout;
	
EndFunction
